docs/posts/sitemap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-15 Thu 15:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blog - Britt Anderson's Personal Website</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9c6e246">1. Setting up email with gnus, mbsync, dovecot, and davmail</a></li>
<li><a href="#org7245843">2. The problem</a></li>
<li><a href="#org2ea4de9">3. Epicurus - If it ain't wrong it is still game</a></li>
<li><a href="#orge3d51bb">4. Coincidence and Inductive Inference</a></li>
<li><a href="#orgdff6389">5. RSS Feeds From Org Mode and Ox-rss</a></li>
<li><a href="#org8c3ade1">6. Publish Your Embarassing Code</a></li>
<li><a href="#org531f863">7. Back to Org Mode</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9c6e246" class="outline-2">
<h2 id="org9c6e246"><span class="section-number-2">1.</span> Setting up email with gnus, mbsync, dovecot, and davmail</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>2023-06-15 Thu</li>
</ul>
</div>
</div>
<div id="outline-container-org7245843" class="outline-2">
<h2 id="org7245843"><span class="section-number-2">2.</span> The problem</h2>
<div class="outline-text-2" id="text-2">
<p>
My university's connect server was recently hacked, which meant that I had to leave the University's internal email system (something I had been resisting for years) for the University's preferred alternative: microsoft 365. So, now I have to reconstruct the pipeline that gets my emails from my various accounts to GNUs on my laptop.
  <a href="2023-06-15-gnus-email-and-microsoft365.html">To read more &#x2026;</a>
</p>
</div>
</div>
<div id="outline-container-org2ea4de9" class="outline-2">
<h2 id="org2ea4de9"><span class="section-number-2">3.</span> Epicurus - If it ain't wrong it is still game</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>2023-05-19 Fri</li>
</ul>
<p>
Most of us are familiar with <a href="https://en.wikipedia.org/wiki/Occam%27s_razor">Occam's Razor.</a> It is a heuristic for reasoning that is often framed as the simplest explanation is the best explanation. What many of us do though is misinterpret this heuristic as suggesting that the simplest explanation is the <b>right</b> explanation. A nice by product of reading some of the literature around Solomonoff induction is to be reminded of the companion idea that any hypothesis not contradicted by experience should be retained in your set of possible answers.
  <a href="2023-05-19-epicurus.html">To read more &#x2026;</a>
</p>
</div>
</div>
<div id="outline-container-orge3d51bb" class="outline-2">
<h2 id="orge3d51bb"><span class="section-number-2">4.</span> Coincidence and Inductive Inference</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>2023-05-15 Mon</li>
</ul>
<p>
During the pandemic, and for a term or two thereafter, I, like a lot of men, let myself grow a beard and let my hair get a bit crazy. One day when I was trying to track down a reference about something (I forget exactly what) I came across this image <a href="https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.wJ0Z713Zmu1ymJu7dv45IAHaKt%26pid%3DApi&amp;f=1&amp;ipt=65c31f7f09559cc54323f891c4c0812e607b7698085d75222ca366bd551e99a7&amp;ipo=images">of Ray Solomonoff</a> and was struck by our similar hair-dos. Who was this guy? While it was the overlapping of my interests and his work that led me to the web page where the picture appeared it was the overlap of our beard aesthetics that led me to read more about him in particular. I am so glad I did.
  <a href="2023-05-15-inductive-inference.html">To read more &#x2026;</a>
</p>
</div>
</div>
<div id="outline-container-orgdff6389" class="outline-2">
<h2 id="orgdff6389"><span class="section-number-2">5.</span> RSS Feeds From Org Mode and Ox-rss</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>2023-04-08 Sat</li>
</ul>
<p>
Just a place holder for now, but to come is a tear stained entry of my efforts to come to terms with RSS feeds and org for blogging.
  <a href="2023-04-08-rss-and-org-mode.html">To read more &#x2026;</a>
</p>
</div>
</div>
<div id="outline-container-org8c3ade1" class="outline-2">
<h2 id="org8c3ade1"><span class="section-number-2">6.</span> Publish Your Embarassing Code</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>2023-04-03 Mon</li>
</ul>
<p>
I am a long term Emacs user, and I love it, but while I am quick to adopt new packages (and frequently break my <code>init.el</code>) I have never fully exploited the fact that Emacs is programmable. The pitch I am making here is to publish your embarassing code so that you help give courage to others to try. You do this by debunking the myth that everyone else is an Uber-coder, and by giving more beginner friendly examples to help people get a leg up.
  <a href="2023-04-03-writing-emacs-lisp.html">To read more &#x2026;</a>
</p>
</div>
</div>
<div id="outline-container-org531f863" class="outline-2">
<h2 id="org531f863"><span class="section-number-2">7.</span> Back to Org Mode</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>2023-01-09 Mon</li>
</ul>
<p>
For sometime now my <a href="https://brittlab.uwaterloo.ca">laboratory website</a> has been in Jekyll.
This was a really nice solution in the beginning.
The look was clean, everyone in the lab could update their own content, and new members could learn to use a mark-up language to write posts.
However, Jekyll and the Ruby engine that powers it have gotten a bit harder to use over the years, and now everytime I want to update the lab webpage I have to figure out how to update all my gems, and various other housekeeping procedures just to write a blog post or remind myself how to create an internal link.
I wanted to simplify again and use something that I would not have to constantly re-educate myself how to use.
  <a href="2023-01-09-back-to-org-mode.html">To read more &#x2026;</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-06-15 Thu 15:00</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>